<?php

namespace Database\Seeders;

use App\Models\Permission;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PermissionSeeder extends Seeder
{
    public function run(): void
    {
        $permissions = [
            ['name' => 'عرض بيانات الشركة'],
            ['name' => 'تعديل بيانات الشركة'],

            ['name' => 'عرض العملاء'],
            ['name' => 'إضافة عميل'],
            ['name' => 'تعديل عميل'],
            ['name' => 'حذف عميل'],

            ['name' => 'إضافة سائق'],
            ['name' => 'تعديل سائق'],
            ['name' => 'حذف سائق'],

            ['name' => 'إضافة شاحنة'],
            ['name' => 'تعديل شاحنة'],
            ['name' => 'حذف شاحنة'],

            ['name' => 'إضافة مورد'],
            ['name' => 'تعديل مورد'],
            ['name' => 'حذف مورد'],

            ['name' => 'إدارة المستخدمين'],

            ['name' => 'عرض العقود'],
            ['name' => 'إضافة عقد'],
            ['name' => 'تجديد عقد'],
            ['name' => 'إرفاق مستند الى العقد'],
            ['name' => 'حذف مستند من العقد'],

            ['name' => 'إضافة خدمة'],
            ['name' => 'تعديل خدمة'],
            ['name' => 'حذف خدمة'],

            ['name' => 'عرض الحاويات'],
            ['name' => 'تعديل حاوية'],
            ['name' => 'إضافة نوع حاوية'],
            ['name' => 'تعديل نوع حاوية'],
            ['name' => 'حذف نوع حاوية'],
            
            ['name' => 'عرض الإتفاقيات'],
            ['name' => 'إنشاء اتفاقية'],

            ['name' => 'عرض الفواتير'],
            ['name' => 'إنشاء فاتورة'],
            ['name' => 'تعديل فاتورة'],
            ['name' => 'طباعة فاتورة'],
            ['name' => 'ترحيل فاتورة'],

            ['name' => 'الإدارة المالية'],
            ['name' => 'إنشاء قيود وسندات'],
            ['name' => 'إنشاء مستوى حساب'],
            ['name' => 'حذف مستوى حساب'],
            ['name' => 'تقارير القيود'],

            ['name' => 'عرض معاملات التخليص'],
            ['name' => 'إنشاء معاملة تخليص'],
            ['name' => 'تعديل معاملة تخليص'],
            ['name' => 'عرض ينود المعاملة'],
            ['name' => 'إضافة بند الى المعاملة'],
            ['name' => 'تعديل بند في المعاملة'],
            ['name' => 'حذف بند من المعاملة'],
            ['name' => 'عرض إجراءات المعاملة'],
            ['name' => 'إضافة إجراء للمعاملة'],
            ['name' => 'تعديل إجراء للمعاملة'],
            ['name' => 'حذف إجراء من المعاملة'],

            ['name' => 'عرض إشعارات النقل'],
            ['name' => 'إنشاء إشعار نقل'],
            ['name' => 'تعديل إشعار نقل'],
            
        ];

        foreach($permissions as $permission) {
            Permission::create($permission);
        }
    }
}
